{
      "bohyun@connect.hku.hk": {
            "name": "Bohyun Sung Kelly",
            "image": "https://i.pinimg.com/736x/49/76/ad/4976ade37bbab6415d0dd4361cc1521c.jpg",
            "video": "https://www.youtube.com/embed/UiWzWHBfVro?si=V8HyxRrxRE23Wsxk",
            "title": "Reversing the Fate: Urgency for Political Action and Carbon Capture in a Changing Climate",
            "text": "The harrowing title 'Polar bears forced to carnivorism due to climate change' struck me with profound disbelief and sorrow. The film depicted a heart-wrenching scene where a polar bear cub, huddled close to its mother, as the father bear, eyes wild with desperation from hunger, turned on his own family while the mother placed herself between the two. Witnessing these magnificent creatures reduced to such desperation by climate change's impacts was overwhelming. In that moment, the urgency to act hit me viscerally. The melting of glaciers is a particularly concerning impact that extends far beyond the plight of polar bears. As these massive ice sheets shrink at accelerating rates, the resulting sea level rise displaces countless human communities, turning inhabitants into climate refugees as their homes and livelihoods are swallowed by the encroaching waters. The loss of glaciers also sets in motion a dangerous positive feedback loop that further exacerbates the climate crisis. Despite widespread awareness of eco-friendly behavior, the crisis continues to worsen. We have naively trusted that people would voluntarily change, but the reality is that without forceful intervention, there is little meaningful progress. This is not due to public ignorance, but our own selfish human nature. Until we directly experience climate change's devastation, its urgency remains an abstract concept we are conveniently oblivious to. Political action has proven far more effective. Measures like paid plastic bags, disposable cup bans, and mandatory recycling have directly reduced waste. Unfortunately, it seems as though our eco-friendly policies require a certain level of invasiveness into day-to-day life otherwise, we will continue neglecting the unfolding emergency. The time has come to forget about voluntary action and embrace the hard truth - forced political changes is our only chance and the most effective solution to survive climate change. One possible way is to incorporate carbon taxing/trading to subsidies for geoengineering. Carbon taxes directly price greenhouse gas emissions, usually per ton of CO2, to make fossil fuel use more expensive and drive emissions cuts. Emissions trading caps total allowed emissions, allocating permits that companies can buy, sell, or trade. This market mechanism incentivizes low-cost emissions reductions. Both carbon taxing and trading aim to harness market forces to drive down greenhouse gas emissions in a cost-effective manner, encouraging the transition to cleaner, renewable energy sources. The revenue generated from carbon taxes should be directed towards funding critical geoengineering, a direct technological intervention to remove greenhouse gases from the atmosphere, such as carbon capture and storage technologies. Carbon capture aims trapping carbon dioxide emissions from industrial sources and injects them underground for long-term storage. Direct air capture systems use chemical processes to extract CO2 directly from the air. At this stage, it may be too late to solely focus on reducing emissions - we must pursue direct interventions to remove greenhouse gases from the atmosphere. This represents a win-win scenario - no individual or group benefits financially, but we all collectively reap the rewards of a healthier planet. The limitation of implementing carbon taxing as a part of this solution is the potential detrimental impact it could have on certain groups, such as low-income families. It is crucial to consider that the wealthiest individuals and corporations contribute the most to climate change. By implementing a tax system that targets these high-emitting individuals and companies, we can ensure they bear a larger financial burden. We must be mindful not to disproportionately affect vulnerable populations and jeopardize their wellbeing. To address this, a politically incentivized system can be established, resembling monthly incentives provided for people in need, aiming to strike a balance between environmental progress and social equity. By introducing a flexible and inclusive framework, we can make this solution more feasible, ensuring both environmental and social sustainability. The reality is that the damage done to our planet has become irreversible, and we must now focus on implementing direct political mitigation strategies such as carbon taxing to fund for large-scale carbon capture, in order to at least slow the inexorable process of global warming. While we may no longer be able to entirely avert the consequences of our actions, we still have a window of opportunity to take bold steps that could minimize the devastation and provide us with a chance to eventually work towards restoring the health of our Earth. Now is the time to unite, to transcend our individual interests, and work towards a future where the sinking fate of both us humans, polar bears and the Earth."
      },
      "whtjanet@connect.hku.hk": {
            "name": "Hiu Tung Wong Janet",
            "image": "https://i.pinimg.com/originals/f5/98/25/f598254424260473bd0f5430a0e2ed26.jpg",
            "video": "https://www.youtube.com/embed/ITrjeF6D29s?si=lA77Sy5dttr6rfG1",
            "title": "N/A",
            "text": "In 2100, sea level flooded the whole of Bangladesh, many refugees came to Hong Kong to make a living. However, Hong Kong is also facing the problem of rising sea level, and both locals and refugees need to be relocated. The dispute between local citizens and climate refugees has come under the spotlight. Maria is a Bangladeshi. Because her village was flooded, she came to Hong Kong 80 years ago. “It is hard for climate refugees to make a living in Hong Kong,” Maria said. Besides, refugees may stir up struggles for the rights of locals and climate refugees. “Local people don’t accept us. We feel isolated.” she went on to say.  Something needs to be done by now– 2024. As a digital native, the first thing that comes to my mind is an Internet platform. The Environment and Ecology Bureau, Hong Kong Observatory and universities in Hong Kong could co-organize a website. Everything related to climate change including the temperature change in Hong Kong, the data of rising sea level, or news can be put on the website. It aims to raise people’s awareness of the urgency of climate change. At the same time, the news of climate refugees must be put on it. For example, over 7 million Bangladeshis became climate refugees in 2022 (Soraya, 2024). And if the earth warms by 4 degrees, nearly 45 million Hong Kong people will be displaced due to rising sea level (Li, 2015). Only when people realize that climate change is imminent and the number of climate refugees is surging, can they accept them, even make real changes to help cope with climate change. Besides, a special zone can be set. Put the environmental protection policies such as the cancellation of the provision of disposable tableware which are already in place in Hong Kong and those to be implemented in the future, to give citizens a sense of participation. There should also be a zone on the platform for refugees. Every walk of life should be linked. Recruitment information, such as job advertisements for social enterprises and those with labour needs such as Foodpanda and Keeta, could be provided. Housing information could also be included. Whether it is cheap housing or temporary shelters provided by the government or organizations, there should be timely updates for refugees. In the absence of comprehensive guidelines, refugees will be isolated and helpless. The administration should expeditiously formulate relevant policies to protect the rights and interests of climate refugees. Climate refugees do not have officially recognised refugee status and cannot receive protection under the refugee policy (Soraya, 2024). “I could not go to primary school,” Maria recalls. It is only through the enactment of legislation about refugees that the Government can protect their basic rights and interests. If these laws are to be put up on a platform website after implementation, refugees will know more clearly what protection they are receiving and will not be deprived by others. From the perspective of the Development Bureau and Hong Kong Institute of Architects, future planning needs first and foremost ensure that the overall planning and architecture of the city can withstand extreme weather. Planning for coastal areas should prevent sea level rise from flooding land and houses. The Afsluitdijk project is an example. These policies which are set to protect residents and prevent the emergence of climate refugees in Hong Kong can also be put on the aforementioned website. From NGOs’ points of view, sharing activities by climate refugees is crucial for local people to know more about the consequences of climate change. NGOs can hold talks in schools and communities, and invite climate refugees to share their personal experiences. This is a golden opportunity to let students and residents know that the impact of climate change on individuals is very serious. At the same time, holding gatherings for refugees can help them to feel supportive and remove the unfamiliarity. “I feel most relaxed when I talk with other climate refugees,” Maria told me. As a university student, I believe that only through the concerted efforts of everyone can we solve the problem of climate refugees, give them the greatest protection and prevent greater harm. Everyone is affected by climate change. Everyone may be Maria. Everyone may help Maria. Start with me, start with the little things. Not wasting water and electricity, taking public transport, bringing your cutlery… A little change goes a long way. I hope Hong Kong in 2100 will be harmonious and beautiful."
      },
      "john1015@connect.hku.hk":{
            "name": "Kon Hei Chan",
            "image": "https://i.pinimg.com/originals/73/82/b6/7382b6216ceef2f59b0d1021cdc855d2.jpg",
            "video": "https://www.youtube.com/embed/PhjgaL6X7Ik?si=CzYWs7VCu86zo4gv",
            "title": "N/A",
            "text": "N/A"
      },
      "u3607888@connect.hku.hk":{
            "name": "Seen Yau Hui Angel",
            "image": "https://i.pinimg.com/originals/20/df/18/20df1828b3225641539ab0bdcf135c1a.jpg",
            "video": "https://www.youtube.com/embed/BhSvszzQw2M?si=iFhgtH3-lG5oNy9V",
            "title": "N/A",
            "text": "N/A"
      },
      "aytseung@connect.hku.hk":{
            "name": "Tseung Yee",
            "image": "https://i.pinimg.com/originals/5c/91/56/5c9156f0cfb4343674695e06fceb93b9.jpg",
            "video": "https://www.youtube.com/embed/afcgFIYt_R8?si=4cWZeHq8pkdsd-Ro",
            "title": "N/A",
            "text": "N/A"
      },
      "kristyku@connect.hku.hk":{
            "name": "Suet Ying Ku Kristy",
            "image": "https://i.pinimg.com/originals/d8/96/87/d89687f3603b6aaa8dee558d64778350.jpg",
            "video": "https://www.youtube.com/embed/Guo7RODPXZI",
            "title": "N/A",
            "text": "N/A"
      },
      "ctyc1209@connect.hku.hk":{
            "name": "Tsz Ying Chan",
            "image": "https://i.pinimg.com/originals/2e/b7/6a/2eb76a0f2b2bd7d73dd605176b72ad08.jpg",
            "video": "https://www.youtube.com/embed/KuOncuhE0s0?si=DoQ0KkyHv4SAiOqV",
            "title": "N/A",
            "text": "N/A"
      },
      "ansonlao@connect.hku.hk":{
            "name": "Ka Hang Lao",
            "image": "https://i.pinimg.com/originals/65/df/96/65df966f9b06368118d91c7bdd15299f.jpg",
            "video": "https://www.youtube.com/embed/fmz9_u5xeT8?si=CAqNJhhyMvtqc_Q5",
            "title": "N/A",
            "text": "N/A"
      },
      "u3627795@connect.hku.hk":{
            "name": "Nathaniel Neil Mccutcheon",
            "image": "https://i.pinimg.com/originals/7a/fc/00/7afc004a37cbc0297e3fa8093849e434.jpg",
            "video": "https://www.youtube.com/embed/Xu7TDIBRn6I?si=QP1Aq1SPB7eyxt0h",
            "title": "N/A",
            "text": "N/A"
      },
      "chinopog@connect.hku.hk":{
            "name": "Lok Sau Lo",
            "image": "https://i.pinimg.com/originals/14/5d/88/145d88efc813b469995b81309fecefda.jpg",
            "video": "https://www.youtube.com/embed/xiXYOkx70cY?si=vAPH0LvNaJQ_jYoP",
            "title": "N/A",
            "text": "N/A"
      },
      "invincer@connect.hku.hk":{
            "name": "Ziqi Zhu Carlo",
            "image": "https://i.pinimg.com/originals/1a/50/cc/1a50cc290491e2ce36119b1c04f0ce57.png",
            "video": "https://www.youtube.com/embed/a7IERGucDlk?si=DmouewBlp_y-zrUp",
            "title": "N/A",
            "text": "N/A"
      },
      "iu3577120@connect.hku.hk":{
            "name": "Xue Luhao",
            "image": "https://i.pinimg.com/originals/ec/cf/6f/eccf6fd5b371a8ab30fd5b801ae08f97.jpg",
            "video": "https://www.youtube.com/embed/kah2gtBSHMQ?si=uqsthDg0el6Nzk-5",
            "title": "N/A",
            "text": "N/A"
      },
      "u3610820@connect.hku.hk":{
            "name": "Christie Tin Yan Tse",
            "image": "https://i.pinimg.com/originals/e9/3b/25/e93b256f0ca91d37fa3f7febd47cb81a.jpg",
            "video": "https://www.youtube.com/embed/UsPZ8X_pYvI?si=GfuwRT3A0R3XGYSr&amp;start=3",
            "title": "N/A",
            "text": "N/A"
      },
      "anson610@connect.hku.hk":{
            "name": "Ka Lam Huang Anson",
            "image": "https://i.pinimg.com/originals/a2/b8/e6/a2b8e6e38fc4c5f0d3b63fbc0effd389.jpg",
            "video": "https://www.youtube.com/embed/xl9y85IQ1Zo?si=8yN6DlE5bXCfplqY",
            "title": "N/A",
            "text": "N/A"
      },
      "ucarrielo@connect.hku.hk":{
            "name": "Carrie Lo",
            "image": "https://i.pinimg.com/originals/1b/8c/65/1b8c65b4e0e77426be4f37f213cf111d.jpg",
            "video": "https://www.youtube.com/embed/_RUOCpuRGoQ?si=aP0TSBiP3zygwZr9",
            "title": "N/A",
            "text": "N/A"
      },
      "u3613617@connect.hku.hk":{
            "name": "Jiyun An",
            "image": "https://i.pinimg.com/originals/da/75/50/da75503298bce432da76e4ac521e6869.jpg",
            "video": "https://www.youtube.com/embed/o4LYdeCbzFI?si=Qk-yUGaEyZtynGHx",
            "title": "N/A",
            "text": "N/A"
      },
      "u3627524@connect.hku.hk":{
            "name": "Cagla Bakan",
            "image": "https://i.pinimg.com/originals/9f/15/a0/9f15a009f7f09b7882b81a36ffa1cc5b.jpg",
            "video": "https://www.youtube.com/embed/38Gbw-j__ck?si=UnxJClsx6b5p12ZY",
            "title": "N/A",
            "text": "N/A"
      },
      "abbycao@connect.hku.hk":{
            "name": "Lok Yin Abby Cao",
            "image": "https://i.pinimg.com/originals/0a/b8/21/0ab82148308748b9831f64938b7ce142.jpg",
            "video": "https://www.youtube.com/embed/jssNM02cu7w?si=1yBOu6lZFpsibs6q",
            "title": "N/A",
            "text": "N/A"
      },
      "tracy308@connect.hku.hk":{
            "name": "Siu Yau Tracy Chan",
            "image": "https://i.pinimg.com/originals/d6/54/1c/d6541cb3125a6d07b3bc68b203dc3997.jpg",
            "video": "https://www.youtube.com/embed/4CPaau0yDxI?si=jAClq19oV9CQ5V53",
            "title": "N/A",
            "text": "N/A"
      },
      "u3586398@connect.hku.hk":{
            "name": "Jun Chen",
            "image": "https://i.pinimg.com/originals/39/fa/bf/39fabf2d36bb333f6a5439491eee2f92.jpg",
            "video": "https://www.youtube.com/embed/mnKBVGjv3uY?si=ZzvNMq9HcBPrY82_",
            "title": "N/A",
            "text": "N/A"
      },
      "ch3618@connect.hku.hk":{
            "name": "Chung Hin Cheng",
            "image": "https://i.pinimg.com/originals/2d/1b/32/2d1b32f8771a18a90a0f500c5a67b0a6.jpg",
            "video": "https://www.youtube.com/embed/HeTXJhegkQU?si=E4XlOJqjPkZPAPFw",
            "title": "N/A",
            "text": "N/A"
      },
      "keta12@connect.hku.hk":{
            "name": "Yu Sin Cheng",
            "image": "https://i.pinimg.com/originals/8c/07/7c/8c077c0af44abbbdbb2184de54741ef1.jpg",
            "video": "https://www.youtube.com/embed/DS8ZfzDTiI0?si=acxcFFlYcxPZWnhF",
            "title": "N/A",
            "text": "N/A"
      },
      "u3623099@connect.hku.hk":{
            "name": "Ying Hei Choi",
            "image": "https://i.pinimg.com/originals/ac/78/28/ac7828b54629cfd5a69e639345375cee.jpg",
            "video": "https://www.youtube.com/embed/L63pbBH29NM?si=lJRpKfL4Y4vs3_6S",
            "title": "N/A",
            "text": "N/A"
      },
      "kellychn@connect.hku.hk":{
            "name": "Hoi Ning Chow",
            "image": "https://i.pinimg.com/originals/cc/11/66/cc1166d1157a589b8679864f623dd4f0.jpg",
            "video": "https://www.youtube.com/embed/_f-MX3JM2FM?si=Dut1_wTJVMQhfkb2",
            "title": "N/A",
            "text": "N/A"
      },
      "kh1023@connect.hku.hk":{
            "name": "Tsz Hin Hsieh",
            "image": "https://i.pinimg.com/originals/26/bb/4a/26bb4add0bb085d64f0623011c347c76.png",
            "video": "https://www.youtube.com/embed/sjXuyTXZfDw?si=aXkqrmwYIiIw8K9D",
            "title": "N/A",
            "text": "N/A"
      },
      "u3614107@connect.hku.hk":{
            "name": "Chiu Lun Kwok",
            "image": "https://i.pinimg.com/originals/3a/6f/81/3a6f819e3c3e3764be4842e7b441b6f7.jpg",
            "video": "https://www.youtube.com/embed/9Ht1OeN0kzQ?si=rYfuIVKPljJn0sjQ",
            "title": "N/A",
            "text": "N/A"
      },
      "u3622126@connect.hku.hk":{
            "name": "Ho Him Lam",
            "image": "https://i.pinimg.com/originals/6a/fc/92/6afc92adad8e366c84b3a6969e3f66e3.jpg",
            "video": "https://www.youtube.com/embed/FGZ5mmOnGBY?si=6Xlyj8fybvu5O5k7",
            "title": "N/A",
            "text": "N/A"
      },
      "wryanl22@connect.hku.hk":{
            "name": "Wing Yan Leung",
            "image": "https://i.pinimg.com/originals/3d/33/83/3d33834b612c1c22f4ef302f9d389aae.jpg",
            "video": "https://www.youtube.com/embed/XiDEaJ-5aGc",
            "title": "N/A",
            "text": "N/A"
      },
      "craig022@connect.hku.hk":{
            "name": "Craig Ng",
            "image": "https://i.pinimg.com/originals/3a/00/a4/3a00a418a5464a689b5284a176528ea8.jpg",
            "video": "https://www.youtube.com/embed/B97Lq8NAyKM?si=Wi1uz_rJMyhHaioA",
            "title": "N/A",
            "text": "N/A"
      },
      "moneyjim@connect.hku.hk":{
            "name": "Tsz Him Ng",
            "image": "https://i.pinimg.com/originals/25/ea/ef/25eaef7c5e22b43430701e02a9085c46.jpg",
            "video": "https://www.youtube.com/embed/Ay_YurbZHLw?si=tFw6-kQMQFepOPuv",
            "title": "N/A",
            "text": "N/A"
      },
      "u3627301@connect.hku.hk":{
            "name": "Lok Him Daniel Tsang",
            "image": "https://i.pinimg.com/originals/1c/d0/3b/1cd03b2fc316e642adb66b93f19abc0f.jpg",
            "video": "https://www.youtube.com/embed/GyLzJhPSXl4?si=4FNVNSDo-dx650kw",
            "title": "N/A",
            "text": "N/A"
      },
      "u3606224@connect.hku.hk":{
            "name": "Kwok Tsz Tseng",
            "image": "https://i.pinimg.com/originals/95/1e/62/951e6291b852d39e4d497c7d588661a5.jpg",
            "video": "https://www.youtube.com/embed/IQK-NDTyes4?si=xE7T4o5llpQQo8LO",
            "title": "N/A",
            "text": "N/A"
      },
      "lthm@connect.hku.hk":{
            "name": "Hei Man Latina Tsui",
            "image": "https://i.pinimg.com/originals/12/96/2b/12962b27c3b68e727f8c761ad834c983.jpg",
            "video": "https://www.youtube.com/embed/zF30t1xuPY8?si=NOEs7bPX61Z_2ROU",
            "title": "N/A",
            "text": "N/A"
      },
      "u3624004@connect.hku.hk":{
            "name": "Ching Man Wang",
            "image": "https://i.pinimg.com/originals/53/09/e7/5309e7b9e55e2334819e68365d37a7c6.jpg",
            "video": "N/A",
            "title": "N/A",
            "text": "N/A"
      },
      "claps159@connect.hku.hk":{
            "name": "Shiu Ho Wong",
            "image": "https://i.pinimg.com/originals/1c/03/af/1c03af69485e8d8a86dbc817ceff636a.jpg",
            "video": "https://www.youtube.com/embed/VN3q7B4uPN0?si=l4owc0zM5A-vc3zE",
            "title": "N/A",
            "text": "N/A"
      },
      "keonawu@connect.hku.hk":{
            "name": "Keona Noelle Ching Wu",
            "image": "https://i.pinimg.com/originals/89/3a/60/893a60fc8d3af86f9e859b22540f0745.jpg",
            "video": "https://www.youtube.com/embed/H3MTHBDCQBg",
            "title": "N/A",
            "text": "N/A"
      },
      "nfei315@connect.hku.hk":{
            "name": "Yifei Xing",
            "image": "https://i.pinimg.com/originals/f3/3f/b0/f33fb0566160aac6fcbcc79b87655ac4.jpg",
            "video": "https://www.youtube.com/embed/oZVKUR-zALA?si=VXgmiRU_HHtc4auf",
            "title": "N/A",
            "text": "N/A"
      },
      "ay200589@connect.hku.hk":{
            "name": "Hiu Chung Yau",
            "image": "https://i.pinimg.com/originals/9a/be/25/9abe25718c484bd6d51df51725175b6d.jpg",
            "video": "https://www.youtube.com/embed/uliGGUrNCdU?si=KTXv-DZ5el0sy39R",
            "title": "N/A",
            "text": "N/A"
      },
      "u3600265@connect.hku.hk":{
            "name": "Ho Yi Yip",
            "image": "https://i.pinimg.com/originals/4e/95/f0/4e95f03cd2f54a8d01964a2b9c17b1b8.jpg",
            "video": "https://www.youtube.com/embed/1Ov18-GeqKU",
            "title": "N/A",
            "text": "N/A"
      },
      "u3599280@connect.hku.hk":{
            "name": "Shing Chi Yu",
            "image": "https://i.pinimg.com/originals/ee/4d/b3/ee4db38ddbdf9e43761507058448cb61.jpg",
            "video": "https://www.youtube.com/embed/DnVjZXJiKXM?si=0T2i6CHJSNxFii7P",
            "title": "N/A",
            "text": "N/A"
      },
      "u3622429@connect.hku.hk":{
            "name": "Man Ki Mason Wong",
            "image": "https://i.pinimg.com/originals/af/29/06/af29063e167de680d639594d01792a09.jpg",
            "video": "https://www.youtube.com/embed/KUHPXWFyQFE?si=Ww5z3osUpIn7J0Q9",
            "title": "N/A",
            "text": "N/A"
      },
      "ssy018@connect.hku.hk":{
            "name": "Sum Yin Siu",
            "image": "https://i.pinimg.com/originals/2a/c5/cd/2ac5cd697be65c9228220516095dec61.jpg",
            "video": "https://www.youtube.com/embed/ZOPnxsK571A?si=wCHm8eZkF5CCagU4",
            "title": "N/A",
            "text": "N/A"
      },
      "sshadow@connect.hku.hk":{
            "name": "Cheuk Lam Lai",
            "image": "https://i.pinimg.com/originals/bc/2a/ff/bc2aff74617fa53b944d6f0be741aead.jpg",
            "video": "https://www.youtube.com/embed/XuFrkOtBt94?si=YeYwKpjlNviHbRBH",
            "title": "N/A",
            "text": "N/A"
      },
      "u3623448@connect.hku.hk":{
            "name": "Wing Sze Chan",
            "image": "https://i.pinimg.com/originals/4f/21/65/4f2165b7ffa64409a9f90b7268b18239.jpg",
            "video": "https://www.youtube.com/embed/0kmUatwhRb4",
            "title": "N/A",
            "text": "N/A"
      },
      "u3607045@connect.hku.hk":{
            "name": "Tsz Fei Cheung",
            "image": "https://i.pinimg.com/originals/1a/72/10/1a7210972be0bc8c618286bbfd9ee636.jpg",
            "video": "https://www.youtube.com/embed/vBIThgA6514",
            "title": "N/A",
            "text": "N/A"
      },
      "vinkami@connect.hku.hk":{
            "name": "Tze Yau Chui",
            "image": "https://i.pinimg.com/originals/93/b3/18/93b318e81f12d9dc736beb035f3299a8.jpg",
            "video": "https://www.youtube.com/embed/5XvCaQICWCI?si=qXjSf9sssZ2bkXXB",
            "title": "N/A",
            "text": "N/A"
      },
      "u3610216@connect.hku.hk":{
            "name": "Yongze Ding",
            "image": "https://i.pinimg.com/originals/06/68/9f/06689f6c92f29b664da2f323a73e3573.jpg",
            "video": "https://www.youtube.com/embed/nT7z0LVAS7E?si=xmgDSuVTYk-HBzrc",
            "title": "N/A",
            "text": "N/A"
      },
      "yaufuu@connect.hku.hk":{
            "name": "Yao Josephine Fu",
            "image": "https://i.pinimg.com/originals/64/72/2e/64722e0c9b3804a9320fd31388ca3b3e.jpg",
            "video": "https://www.youtube.com/embed/WEeuG2q4KNY?si=rOPlzYa7_ElGIW5q",
            "title": "N/A",
            "text": "N/A"
      },
      "u3613579@connect.hku.hk":{
            "name": "Sze Yuet Ho",
            "image": "https://i.pinimg.com/originals/5f/75/82/5f75825a205ec942d60aeb8a64c43313.jpg",
            "video": "https://www.youtube.com/embed/5iKwPXLHn0A?si=EyDJJdT_IlRXhT2W",
            "title": "N/A",
            "text": "N/A"
      },
      "u3612833@connect.hku.hk":{
            "name": "Sixian Huo",
            "image": "https://i.pinimg.com/originals/ab/e2/94/abe2945c4a6200b9796481bc57adafaf.jpg",
            "video": "https://www.youtube.com/embed/YIoey17M7fM?si=8JK0Uvt5hJKYRaL8",
            "title": "N/A",
            "text": "N/A"
      },
      "u3621909@connect.hku.hk":{
            "name": "Tsz Yin Ng",
            "image": "https://i.pinimg.com/originals/3b/a8/b8/3ba8b8c11907f27be3a2b77c54e4006c.jpg",
            "video": "https://www.youtube.com/embed/D68vYfkeKnU?si=xXLiteDHlChoZ7YQ",
            "title": "N/A",
            "text": "N/A"
      },
      "thomast0@connect.hku.hk":{
            "name": "Chi Hong Tang",
            "image": "https://i.pinimg.com/originals/15/c2/a1/15c2a1cc2828fcfbb83f89dc55198150.jpg",
            "video": "https://www.youtube.com/embed/Hl45AZyQd9k?si=OoNLYLtg4GlbEmDq",
            "title": "N/A",
            "text": "N/A"
      },
      "u3607800@connect.hku.hk":{
            "name": "Hon Ting Tang",
            "image": "https://i.pinimg.com/originals/0a/a8/73/0aa873f1cfc218191471d4d5554ca315.jpg",
            "video": "https://www.youtube.com/embed/_QqdoTI1LO4?si=qsZV_m-GWIS_0TIT",
            "title": "N/A",
            "text": "N/A"
      },
      "arianna7@connect.hku.hk":{
            "name": "Kei Lam Arianna Tsang",
            "image": "https://i.pinimg.com/originals/ec/e3/6f/ece36f0ae13d0da58a09305c9f39606d.jpg",
            "video": "https://www.youtube.com/embed/GTAK7KRmn-4?si=2Vumx5rZWMaYsu-L",
            "title": "N/A",
            "text": "N/A"
      },
      "u3605896@connect.hku.hk":{
            "name": "Kin Ming Tsoi",
            "image": "https://i.pinimg.com/originals/28/b2/18/28b2185d59e2053335ff253a4c6fa521.png",
            "video": "https://www.youtube.com/embed/wh-LPfJaojg?si=Y02QIm55v3wRp1YB",
            "title": "N/A",
            "text": "N/A"
      },
      "kekw@connect.hku.hk":{
            "name": "Kei Yin Yu",
            "image": "https://i.pinimg.com/originals/79/b4/7e/79b47e4baa5bf9bb6e48159af042d109.jpg",
            "video": "https://www.youtube.com/embed/Zm-JcnjAL4o?si=BZqUcdHZo0gTndrm",
            "title": "N/A",
            "text": "N/A"
      },
      "u3622527@connect.hku.hk":{
            "name": "Tsz Lo Zeng",
            "image": "https://i.pinimg.com/originals/bc/52/d8/bc52d86d5d7e25ed84d1a12eab4b8659.jpg",
            "video": "https://www.youtube.com/embed/Bi4OwjzwxBk?si=_CmrMw1a3-J1G4Ry",
            "title": "N/A",
            "text": "N/A"
      },
      "u3597319@connect.hku.hk":{
            "name": "Jingchun Zhang",
            "image": "https://i.pinimg.com/originals/66/5b/93/665b931c241d3afc280ff852b54a9b99.jpg",
            "video": "https://www.youtube.com/embed/m5FTl5sKdpY?si=ic9-phKizxsJnQah",
            "title": "N/A",
            "text": "N/A"
      },
      "u3607513@connect.hku.hk":{
            "name": "Runze Zhu",
            "image": "https://i.pinimg.com/originals/42/d2/b2/42d2b2942b7bb3d1c551c9a1deffd041.jpg",
            "video": "https://www.youtube.com/embed/5DxE956xFgU?si=pZe-w_DrVCexzk3c",
            "title": "N/A",
            "text": "N/A"
      },
      "joshb33@connect.hku.hk":{
            "name": "Joshua James Banks",
            "image": "https://i.pinimg.com/originals/ca/64/bb/ca64bb024bcc5453301ac4b57df0c645.jpg",
            "video": "https://www.youtube.com/embed/9WerPNBndpI?si=7GMgxwTr3ixpblQo",
            "title": "N/A",
            "text": "N/A"
      },
      "u3607639@connect.hku.hk":{
            "name": "Shing Chak Poon",
            "image": "https://i.pinimg.com/originals/d5/74/7f/d5747febb09239a3b6241745c5e3a790.jpg",
            "video": "https://www.youtube.com/embed/7waL6QQgX2A?si=iP2tKFb08Vrz-a2E",
            "title": "N/A",
            "text": "N/A"
      },
      "u3617890@connect.hku.hk":{
            "name": "Alison Hau Yee Wong",
            "image": "https://i.pinimg.com/originals/0d/28/29/0d2829232007657b903d0cbb6e7b5492.png",
            "video": "N/A",
            "title": "N/A",
            "text": "N/A"
      },
      "u3574344@connect.hku.hk":{
            "name": "Won Kim",
            "image": "https://i.pinimg.com/originals/38/1e/15/381e15712074faf62d20be04f245843a.jpg",
            "video": "https://www.youtube.com/embed/VamOtHZESiQ?si=RDbGwPYGDE3ouZjp",
            "title": "N/A",
            "text": "N/A"
      },
      "u3624827@connect.hku.hk":{
            "name": "Tsz Ching Wong",
            "image": "https://i.pinimg.com/originals/f3/e9/12/f3e912ce6c72e452a0fcd28e7b44428e.jpg",
            "video": "https://www.youtube.com/embed/C4jImxAnCcw?si=Ct1vlgEujF1cjX8d",
            "title": "N/A",
            "text": "N/A"
      },
      "tigertty@connect.hku.hk":{
            "name": "Yixuan Li",
            "image": "https://i.pinimg.com/originals/a1/16/a9/a116a972d467cc710da26a28cf458211.jpg",
            "video": "https://www.youtube.com/embed/0otvPNFphfg?si=wVLJUc-1X7-EsQIj",
            "title": "N/A",
            "text": "N/A"
      },
      "ngtsznam@connect.hku.hk":{
            "name": "Tsz Nam Ng",
            "image": "https://i.pinimg.com/originals/52/b4/2c/52b42cc626a19d058e3d826a6902de88.jpg",
            "video": "https://www.youtube.com/embed/hSP1H-od8ic",
            "title": "N/A",
            "text": "N/A"
      },
      "brar2024@connect.hku.hk":{
            "name": "Rajwinder Brar",
            "image": "https://i.pinimg.com/originals/23/f6/21/23f6211c33baf5b43228fbe70f9a73c4.jpg",
            "video": "https://www.youtube.com/embed/-NKdn5KW4vg?si=M7Negq_vTB-PC0xo",
            "title": "N/A",
            "text": "N/A"
      },
      "foah@connect.hku.hk":{
            "name": "Liangmao Long",
            "image": "https://i.pinimg.com/originals/6f/92/cf/6f92cf8f23c13d3b192e746a0d59eeed.jpg",
            "video": "https://www.youtube.com/embed/kFXH8-GNB_Q?si=JV22IMGPIKa5qkL6",
            "title": "N/A",
            "text": "N/A"
      },
      "u3609821@connect.hku.hk":{
            "name": "Guocheng Li",
            "image": "https://i.pinimg.com/originals/76/ea/87/76ea87a78624065defcc4590f1c688f5.png",
            "video": "https://www.youtube.com/embed/fJ9SoCK0WNg?si=jzJjqnTzaVqbtdjs",
            "title": "N/A",
            "text": "N/A"
      },
      "ben0209@connect.hku.hk":{
            "name": "Ho Lam Li",
            "image": "https://i.pinimg.com/originals/2b/26/8f/2b268f4eb28710f4a43aebb8dd1c9548.jpg",
            "video": "https://www.youtube.com/embed/WcPHILCj54c?si=lWwb1Z4Kl3q5rpgr",
            "title": "N/A",
            "text": "N/A"
      },
      "u3610315@connect.hku.hk":{
            "name": "Yaxuan She",
            "image": "https://i.pinimg.com/originals/f9/15/74/f91574af9101dbc76ccc342fe4fc21e5.jpg",
            "video": "https://www.youtube.com/embed/6AAIr-XY7tk?si=Op_wStLZBNWRSfm7",
            "title": "N/A",
            "text": "N/A"
      },
      "u3610154@connect.hku.hk":{
            "name": "Lee Chun Chow",
            "image": "https://i.pinimg.com/originals/2b/e1/89/2be1894434b0f5427f37560b43d28b04.jpg",
            "video": "https://www.youtube.com/embed/tuIuMlF4Jls?si=sCgT77diVFhZ8Te_",
            "title": "N/A",
            "text": "N/A"
      },
      "winkit@connect.hku.hk":{
            "name": "Wing Ki Tsang",
            "image": "https://i.pinimg.com/originals/95/a0/92/95a09295631d04744a84e408dea9f9c7.jpg",
            "video": "https://www.youtube.com/embed/852bjccUpMM?si=7ff7QkXB0nKfQGIe",
            "title": "N/A",
            "text": "N/A"
      },
      "u3585574@connect.hku.hk":{
            "name":"Enle Yang",
            "image": "https://i.pinimg.com/originals/48/9e/95/489e957789117ba1137b8ccadd8820df.jpg",
            "video": "https://www.youtube.com/embed/K0Sq3krzKlA?si=e0l4A3S3KTEl3-sD",
            "title": "N/A",
            "text": "N/A"
      },
      "u3584538@connect.hku.hk":{
            "name": "Yazhuo Han",
            "image": "https://i.pinimg.com/originals/46/35/e9/4635e9f094e6fed2a07004045b602626.jpg",
            "video": "https://www.youtube.com/embed/W13VC50SzOA?si=tFEu5T-d81BFxIJc",
            "title": "N/A",
            "text": "N/A"
      },
      "u3585503@connect.hku.hk":{
            "name": "Xin Huang",
            "image": "https://i.pinimg.com/originals/5a/f1/b6/5af1b6c0a51cad31d3f3b45d3ce5ecb1.jpg",
            "video": "https://www.youtube.com/embed/TAdf9ouy_P0?si=GCami0vepn3Z4d4h",
            "title": "N/A",
            "text": "N/A"
      },
      "lihyhuey@connect.hku.hk":{
            "name": "Hin Ying Li",
            "image": "https://i.pinimg.com/originals/7d/6c/53/7d6c53aa2ee216adbd688cbd66cb9ef4.jpg",
            "video": "https://www.youtube.com/embed/L2-14JiuMWA?si=NISOFz5SyU13PO2A",
            "title": "N/A",
            "text": "N/A"
      },
      "juchik35@connect.hku.hk":{
            "name": "Wing Yan Chik",
            "image": "https://i.pinimg.com/originals/49/5d/ff/495dff89f1134c3aec599279f9091285.jpg",
            "video": "https://www.youtube.com/embed/mZBEgVbE9EI",
            "title": "N/A",
            "text": "N/A"
      },
      "u3582422@connect.hku.hk":{
            "name": "Minchan Lee",
            "image": "https://i.pinimg.com/originals/c8/77/9f/c8779f11450ac422b8a10557bf10419d.jpg",
            "video": "https://www.youtube.com/embed/izE1tQQwQkY?si=foCVQE-9OzH-hs68",
            "title": "N/A",
            "text": "N/A"
      },
      "mstcy@connect.hku.hk":{
            "name": "Chun Yin Tse",
            "image": "https://i.pinimg.com/originals/69/be/4e/69be4e2c8f27d7f8286a9013f0a531d0.jpg",
            "video": "https://www.youtube.com/embed/C_vKJFUpqrY?si=GFgQqIPN_2XnSlVd",
            "title": "N/A",
            "text": "N/A"
      },
      "u3592796@connect.hku.hk":{
            "name": "Chi Ying Chan",
            "image": "https://i.pinimg.com/originals/6a/32/ce/6a32ce3c07fbfa8f9337362444be41f4.jpg",
            "video": "https://www.youtube.com/embed/t1smcTY1Dlo?si=7rpnYoJ25kWkiKYN",
            "title": "N/A",
            "text": "N/A"
      },
      "scott525@connect.hku.hk":{
            "name": "Tin Yui Liu",
            "image": "https://i.pinimg.com/originals/f7/b9/36/f7b936420740440d7d45216052887095.jpg",
            "video": "https://www.youtube.com/embed/lABvpszDiW0?si=9yRdy9pFwk7vCgOP",
            "title": "N/A",
            "text": "N/A"
      },
      "skymia@connect.hku.hk":{
            "name": "Ka Ying Sun",
            "image": "https://i.pinimg.com/originals/10/96/db/1096dbc7c2c0a406a4c2d978e43392b7.jpg",
            "video": "https://www.youtube.com/embed/cE4KidtFxTs?si=4mbo8mB5oYl6U8NK",
            "title": "N/A",
            "text": "N/A"
      },
      "u3606894@connect.hku.hk":{
            "name": "Cheuk Hin Fung",
            "image": "https://i.pinimg.com/originals/36/b4/6e/36b46ecc28f2f0feb4b161a99ceb6050.jpg",
            "video": "https://www.youtube.com/embed/zUHDq7CmOYE?si=UGQu6nAVK56FhzUW",
            "title": "N/A",
            "text": "N/A"
      },
      "ananya11@connect.hku.hk":{
            "name": "Ananya Bisht",
            "image": "https://i.pinimg.com/originals/a3/b9/dc/a3b9dcad08c6a10d16e620904e1c083d.jpg",
            "video": "https://www.youtube.com/embed/ttotMhkLlvM?si=VQcUlBMZ3szXKUCY",
            "title": "N/A",
            "text": "N/A"
      },
      "u3618815@connect.hku.hk":{
            "name": "Peijing Lin",
            "image": "https://i.pinimg.com/originals/6f/e1/9a/6fe19a1beb9f03715f2a2e70447e4ec7.jpg",
            "video": "https://www.youtube.com/embed/QTfX53bUcqI",
            "title": "N/A",
            "text": "N/A"
      },
      "u3622954@connect.hku.hk":{
            "name": "Chi Lam Gianna Chin",
            "image": "https://i.pinimg.com/originals/e6/65/b4/e665b4a95c19009d9a9145541b02fab7.jpg",
            "video": "N/A",
            "title": "N/A",
            "text": "N/A"
      },
      "u3600356@connect.hku.hk":{
            "name": "Sai Hin Ma",
            "image": "https://i.pinimg.com/originals/5b/02/fe/5b02febc70c7989ad53d1ce2e702bada.jpg",
            "video": "https://www.youtube.com/embed/RAx_FdwZzHs?si=JmOuGeH7SHMo4LTJ",
            "title": "N/A",
            "text": "N/A"
      },
      "katiek23@connect.hku.hk":{
            "name": "Yan Chi Katie Keung",
            "image": "https://i.pinimg.com/originals/ed/73/3a/ed733aa6655c12f8a556ae2021707ad9.jpg",
            "video": "https://www.youtube.com/embed/O3n8KGdiVLw?si=qAiEvJzSr_2hy6W9",
            "title": "N/A",
            "text": "N/A"
      },
      "mopoon@connect.hku.hk":{
            "name": "Chun Him Poon",
            "image": "https://i.pinimg.com/originals/0e/e5/48/0ee548145d2dd2e4b8c2fb1752eeff60.jpg",
            "video": "https://www.youtube.com/embed/JmSc2EVZyYc?si=6smWfyPXWrKIEwqf",
            "title": "N/A",
            "text": "N/A"
      },
      "u3597473@connect.hku.hk":{
            "name": "Yiming Ren",
            "image": "https://i.pinimg.com/originals/e6/13/d5/e613d5e057f378fef9f74b59125294c0.jpg",
            "video": "N/A",
            "title": "N/A",
            "text": "N/A"
      },
      "u3618282@connect.hku.hk":{
            "name": "Anna Au",
            "image": "N/A",
            "video": "N/A",
            "title": "N/A",
            "text": "N/A"
      },
      "u3627292@connect.hku.hk":{
            "name": "Lung Chak Chan",
            "image": "N/A",
            "video": "N/A",
            "title": "N/A",
            "text": "N/A"
      },
      "ryan2022@connect.hku.hk":{
            "name": "Hiu Wai Yuen",
            "image": "N/A",
            "video": "N/A",
            "title": "N/A",
            "text": "N/A"
      },
      "u3623073@connect.hku.hk":{
            "name": "Tsun Hei Yip",
            "image": "N/A",
            "video": "N/A",
            "title": "N/A",
            "text": "N/A"
      },
      "u3577073@connect.hku.hk":{
            "name": "Baorui Li",
            "image": "N/A",
            "video": "N/A",
            "title": "N/A",
            "text": "N/A"
      },
      "mattccy@connect.hku.hk":{
            "name": "Chi Yui Chung",
            "image": "https://i.pinimg.com/originals/72/cd/e4/72cde46429f0b95af8aa202e28e425c3.jpg",
            "video": "N/A",
            "title": "N/A",
            "text": "N/A"
      },
      "kkzhang@connect.hku.hk":{
            "name": "Ke Zhang",
            "image": "N/A",
            "video": "N/A",
            "title": "N/A",
            "text": "N/A"
      },
      "u3600200@connect.hku.hk":{
            "name": "Wilson Wu",
            "image": "N/A",
            "video": "N/A",
            "title": "N/A",
            "text": "N/A"
      }
}